micropython/micropython/ports/stm32/extint.c
static const uint8_t nvic_irq_channel[EXTI_NUM_VECTORS] = {
    #if defined(STM32F0) || defined(STM32L0) || defined(STM32G0)

    EXTI0_1_IRQn,  EXTI0_1_IRQn,  EXTI2_3_IRQn,  EXTI2_3_IRQn,
    EXTI4_15_IRQn, EXTI4_15_IRQn, EXTI4_15_IRQn, EXTI4_15_IRQn,
    EXTI4_15_IRQn, EXTI4_15_IRQn, EXTI4_15_IRQn, EXTI4_15_IRQn,
    EXTI4_15_IRQn, EXTI4_15_IRQn, EXTI4_15_IRQn, EXTI4_15_IRQn,
    #if defined(STM32L0)
    PVD_IRQn,
    #else
    PVD_VDDIO2_IRQn,
    #endif
    #if defined(STM32G0)
    ADC1_COMP_IRQn,
    ADC1_COMP_IRQn,
    RTC_TAMP_IRQn,
    0, // COMP3
    RTC_TAMP_IRQn,// 21
    #else
    RTC_IRQn,
    0, // internal USB wakeup event
    RTC_IRQn,
    RTC_IRQn,
    ADC1_COMP_IRQn,
    ADC1_COMP_IRQn,
    #endif

    #elif defined(STM32N6) || defined(STM32H5) || defined(STM32U5)

    EXTI0_IRQn,
    EXTI1_IRQn,
    EXTI2_IRQn,
    EXTI3_IRQn,
    EXTI4_IRQn,
    EXTI5_IRQn,
    EXTI6_IRQn,
    EXTI7_IRQn,
    EXTI8_IRQn,
    EXTI9_IRQn,
    EXTI10_IRQn,
    EXTI11_IRQn,
    EXTI12_IRQn,
    EXTI13_IRQn,
    EXTI14_IRQn,
    EXTI15_IRQn,

    #if defined(STM32N6)
    0,
    RTC_S_IRQn,
    RTC_IRQn,
    TAMP_IRQn,
    #endif

    #else

    EXTI0_IRQn,     EXTI1_IRQn,     EXTI2_IRQn,     EXTI3_IRQn,     EXTI4_IRQn,
    EXTI9_5_IRQn,   EXTI9_5_IRQn,   EXTI9_5_IRQn,   EXTI9_5_IRQn,   EXTI9_5_IRQn,
    EXTI15_10_IRQn, EXTI15_10_IRQn, EXTI15_10_IRQn, EXTI15_10_IRQn, EXTI15_10_IRQn,
    EXTI15_10_IRQn,
    #if defined(STM32H7)
    PVD_AVD_IRQn,
    RTC_Alarm_IRQn,
    #if defined(STM32H7A3xx) || defined(STM32H7A3xxQ) || defined(STM32H7B3xx) || defined(STM32H7B3xxQ)
    RTC_TAMP_STAMP_CSS_LSE_IRQn,
    #else
    TAMP_STAMP_IRQn,
    #endif
    RTC_WKUP_IRQn,
    #elif defined(STM32WB)
    PVD_PVM_IRQn,
    RTC_Alarm_IRQn,
    TAMP_STAMP_LSECSS_IRQn,
    RTC_WKUP_IRQn,
    #elif defined(STM32WL)
    PVD_PVM_IRQn,
    RTC_Alarm_IRQn,
    TAMP_STAMP_LSECSS_SSRU_IRQn, // SSRU
    TAMP_STAMP_LSECSS_SSRU_IRQn, // TAMP, RTC_STAMP, LSE_CSS
    RTC_WKUP_IRQn,
    #else
    #if defined(STM32G4) || defined(STM32L4)
    PVD_PVM_IRQn,
    #else
    PVD_IRQn,
    #endif
    #if defined(STM32L4)
    OTG_FS_WKUP_IRQn,
    RTC_Alarm_IRQn,
    #else
    RTC_Alarm_IRQn,
    OTG_FS_WKUP_IRQn,
    #endif
    ETH_WKUP_IRQn,
    OTG_HS_WKUP_IRQn,
    #if defined(STM32L1)
    TAMPER_STAMP_IRQn,
    #else
    TAMP_STAMP_IRQn,
    #endif
    RTC_WKUP_IRQn,
    #endif

    #endif
};

#define DEFINE_EXTI_IRQ_HANDLER(line) \
    void EXTI##line##_IRQHandler(void) { \
        MP_STATIC_ASSERT(EXTI##line##_IRQn > 0); \
        IRQ_ENTER(EXTI##line##_IRQn); \
        Handle_EXTI_Irq(line); \
        IRQ_EXIT(EXTI##line##_IRQn); \
    }

#if defined(STM32F0) || defined(STM32L0) || defined(STM32G0)

void EXTI0_1_IRQHandler(void) {
    MP_STATIC_ASSERT(EXTI0_1_IRQn > 0);
    IRQ_ENTER(EXTI0_1_IRQn);
    Handle_EXTI_Irq(0);
    Handle_EXTI_Irq(1);
    IRQ_EXIT(EXTI0_1_IRQn);
}

void EXTI2_3_IRQHandler(void) {
    MP_STATIC_ASSERT(EXTI2_3_IRQn > 0);
    IRQ_ENTER(EXTI2_3_IRQn);
    Handle_EXTI_Irq(2);
    Handle_EXTI_Irq(3);
    IRQ_EXIT(EXTI2_3_IRQn);
}

void EXTI4_15_IRQHandler(void) {
    MP_STATIC_ASSERT(EXTI4_15_IRQn > 0);
    IRQ_ENTER(EXTI4_15_IRQn);
    for (int i = 4; i <= 15; ++i) {
        Handle_EXTI_Irq(i);
    }
    IRQ_EXIT(EXTI4_15_IRQn);
}

#elif defined(STM32F4) || defined(STM32F7) || defined(STM32G4) || defined(STM32H7) || defined(STM32L1) || defined(STM32L4) || defined(STM32WB) || defined(STM32WL)

DEFINE_EXTI_IRQ_HANDLER(0)
DEFINE_EXTI_IRQ_HANDLER(1)
DEFINE_EXTI_IRQ_HANDLER(2)
DEFINE_EXTI_IRQ_HANDLER(3)
DEFINE_EXTI_IRQ_HANDLER(4)

void EXTI9_5_IRQHandler(void) {
    MP_STATIC_ASSERT(EXTI9_5_IRQn > 0);
    IRQ_ENTER(EXTI9_5_IRQn);
    Handle_EXTI_Irq(5);
    Handle_EXTI_Irq(6);
    Handle_EXTI_Irq(7);
    Handle_EXTI_Irq(8);
    Handle_EXTI_Irq(9);
    IRQ_EXIT(EXTI9_5_IRQn);
}

void EXTI15_10_IRQHandler(void) {
    MP_STATIC_ASSERT(EXTI15_10_IRQn > 0);
    IRQ_ENTER(EXTI15_10_IRQn);
    Handle_EXTI_Irq(10);
    Handle_EXTI_Irq(11);
    Handle_EXTI_Irq(12);
    Handle_EXTI_Irq(13);
    Handle_EXTI_Irq(14);
    Handle_EXTI_Irq(15);
    IRQ_EXIT(EXTI15_10_IRQn);
}

#elif defined(STM32H5) || defined(STM32N6) || defined(STM32U5)

DEFINE_EXTI_IRQ_HANDLER(0)
DEFINE_EXTI_IRQ_HANDLER(1)
DEFINE_EXTI_IRQ_HANDLER(2)
DEFINE_EXTI_IRQ_HANDLER(3)
DEFINE_EXTI_IRQ_HANDLER(4)
DEFINE_EXTI_IRQ_HANDLER(5)
DEFINE_EXTI_IRQ_HANDLER(6)
DEFINE_EXTI_IRQ_HANDLER(7)
DEFINE_EXTI_IRQ_HANDLER(8)
DEFINE_EXTI_IRQ_HANDLER(9)
DEFINE_EXTI_IRQ_HANDLER(10)
DEFINE_EXTI_IRQ_HANDLER(11)
DEFINE_EXTI_IRQ_HANDLER(12)
DEFINE_EXTI_IRQ_HANDLER(13)
DEFINE_EXTI_IRQ_HANDLER(14)
DEFINE_EXTI_IRQ_HANDLER(15)

#else

#error Unsupported processor

#endif

// Set override_callback_obj to true if you want to unconditionally set the
// callback function.
uint extint_register(mp_obj_t pin_obj, uint32_t mode, uint32_t pull, mp_obj_t callback_obj, bool override_callback_obj) {
    const machine_pin_obj_t *pin = NULL;
    uint v_line;

    if (mp_obj_is_int(pin_obj)) {
        // If an integer is passed in, then use it to identify lines 16 thru 22
        // We expect lines 0 thru 15 to be passed in as a pin, so that we can
        // get both the port number and line number.
        v_line = mp_obj_get_int(pin_obj);
        if (v_line < 16) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("ExtInt vector %d < 16, use a Pin object"), v_line);
        }
        if (v_line >= EXTI_NUM_VECTORS) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("ExtInt vector %d >= max of %d"), v_line, EXTI_NUM_VECTORS);
        }
    } else {
        pin = pin_find(pin_obj);
        v_line = pin->pin;
    }
    if (mode != GPIO_MODE_IT_RISING &&
        mode != GPIO_MODE_IT_FALLING &&
        mode != GPIO_MODE_IT_RISING_FALLING &&
        mode != GPIO_MODE_EVT_RISING &&
        mode != GPIO_MODE_EVT_FALLING &&
        mode != GPIO_MODE_EVT_RISING_FALLING) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("invalid ExtInt Mode: %d"), mode);
    }
    if (pull != GPIO_NOPULL &&
        pull != GPIO_PULLUP &&
        pull != GPIO_PULLDOWN) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("invalid ExtInt Pull: %d"), pull);
    }

